//Напишите программу , которая
//1. на вход принимает число и
//2. выдаёт его квардрат ( число умноженное само на себя) .

//Например :
//4 -> 16
//-3 -> 9
//-7 -> 49
Console.WriteLine("Введите целлое число: ");
int number = Convert.ToInt32( Console.ReadLine());
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");

if(number == 1) System.Console.WriteLine();
else if(number == 2) System.Console.WriteLine();
else if(number == 3) System.Console.WriteLine();
else if(number == 1) System.Console.WriteLine();
else if(number == 1) System.Console.WriteLine();
else if(number == 1) System.Console.WriteLine();
else if(number == 1) System.Console.WriteLine();
else if(number == 1) System.Console.WriteLine();